<?php
header("Content-Type:application/json;chartset=uft-8");

sleep(1);

$id = isset($_GET['id']) ? $_GET['id'] : false;
$touid = isset($_GET['touid']) ? $_GET['touid'] : false;

if(!$id || !$touid) {
    $resErr = [
        'code' => 100, 
        'msg' => '请求失败',
        'data' => []
    ];
    $json = json_encode($resErr, JSON_UNESCAPED_UNICODE);
    exit($json);
}

$desc_p = '';

$descArr = [
    [
        'touid' => 1,
        'content' => '这张照片是我5岁和妈妈的合照，照片中的妈妈那么年轻漂亮。每当我看到妈妈那双美丽而又深沉的眼睛时,我真想扑进妈妈的怀里,对她说:“我爱你,妈妈。”选出最美母亲，请投我一票。这张照片是我5岁和妈妈的合照，照片中的妈妈那么年轻漂亮。每当我看到妈妈那双美丽而又深沉的眼睛时,我真想扑进妈妈的怀里,对她说:“我爱你,妈妈。”选出最美母亲，请投我一票。'
    ],
    [
        'touid' => 2,
        'content' => '母爱就像一首田园诗，幽远纯净，和雅清淡;母爱就像一幅山水画，洗去铅华雕饰，留下清新自然;母爱就像一首深情的歌，婉转悠扬，轻吟浅唱;母爱就是一阵和煦的春风，吹去朔雪纷飞，带来春光无限。母爱就是一生盈盈相伴的笑语，母爱就是漂泊天涯的缕缕思念，母爱就是病榻前的关切焦灼，母爱就是儿女成长的殷殷期盼。'
    ],
    [
        'touid' => 3,
        'content' => '孟郊云：慈母手中线，游子身上衣。临行密密缝，意恐迟迟归。谁言寸草心，报得三春晖?是啊，世上最最伟大的爱，人间最最深厚的真情――那是母爱。母爱，有时是大树，有时是暖茶，有时是棉被……变的是爱的表达方式，不变的是对子女的那份爱;有母亲在的日子，有时是甜，有时是苦，有时是幸福，有时是酸楚……变的是感觉，不会变的是真实。'
    ],
    [
        'touid' => 4,
        'content' => '妈妈对我得辛勤劳动给予了充分肯定，我明白了做家务活虽然很辛苦，但每一句话，每一份工作都有我辛勤的汗水。而妈妈每一句夸奖我的话就是“兴奋剂”。我懂得了做人的责任，更懂得了母爱的力量，品尝母爱的甘甜。'
    ],
    [
        'touid' => 5,
        'content' => '历史的长河不能淹没伟大的母爱，但岁月给我们带来的却是母爱中的精华。母爱如春风，一次又一次抚平我们内心的创伤;母爱如夏雨，一次又一次滋润着我们的心田;母爱如冬雪，一次又一次为大地带来无限的欢乐。也许母爱为我们带来的远不止这些，但我可以通过内心的感动来体会这世间最美丽的爱。'
    ],
    [
        'touid' => 6,
        'content' => '母爱是伟大的，同时也是悲凉的，我们歌颂母爱，但往往是时过境迁之后。正当青春年少时的你我，并不能完全理解在母亲那细微的言谈举止之中，所蕴藏的深深柔情。直到有一天，我们也为人父母了，才逐渐地从自身经历体会到：妈妈，这一声永恒的叫唤，背后却掩藏着无数个日夜等待你回家的忧愁，无数次将手浸泡在洗衣粉中的受伤，无数次为你做饭吸入油烟的伤害，无数次为了让你吃得更好，为了让你上学而忘我奔波、劳累……'
    ],
    [
        'touid' => 7,
        'content' => '母亲，有丰富的素养，说到这你一定会想，那您的母亲一定是很职业的女性吧?不!母亲，只是个普通的农村妇女，但是她给我的却是我用几辈子也消化不完的。我并不觉得农村人有什么可不好意思的，因为他们更勤劳更善良，我爱我的故乡，我爱我的母亲。'
    ]
];

foreach($descArr as $item) {
    if($item['touid'] == $touid) {
        $desc_p = $item['content'];
        break;
    }
}

$res = [
    'code' => 0,
    'msg' => '请求成功',
    'data' => [
        'id' => $id,
        'touid' => $touid,
        'description' => $desc_p,
        'tickets' => mt_rand(10, 9999),
        'title' => '何玉莹和母亲',
        'text' => '感谢我的母亲，感谢她对我的爱',
        'image' => "images/{$touid}.png"
    ]
];  
$json = json_encode($res, JSON_UNESCAPED_UNICODE);
exit($json);